<?php
$GLOBALS['__SORTS'] = array(
		'1' => array(
        'text'=>'航旅交通',
        'sub'=>array(
            '101' => array(
                'text' => '公共交通',
                'sub' => array(
                    '10101' => array('text' => '公共交通'),
                    '10102' => array('text' => '铁路客运'),
                    '10103' => array('text' => '出租车服务（TAXI）'),
                    '10104' => array('text' => '长途公路客运'),
                    '10105' => array('text' => '游轮及巡游航线服务'),
                )
            ),
            '102' => array(
                'text' => '物流仓储',
                'sub' => array(
                    '10201' => array('text' => '物流货运服务'),
                    '10202' => array('text' => '快递服务'),
                )
            ),
            '103' => array(
                'text' => '航空票务',
                'sub' => array(
                    '10301' => array('text' => '航空公司'),
                    '10302' => array('text' => '机票代理人'),
                    '10303' => array('text' => '机票平台'),
                    '10304' => array('text' => '航空系统商'),
                )
            ),
            '104' => array(
                'text' => '旅游住宿',
                'sub' => array(
                    '10401' => array('text' => '旅行社和旅游服务'),
                    '10402' => array('text' => '大型旅游景点'),
                    '10403' => array('text' => '住宿服务（旅馆、酒店、汽车旅馆、度假村等）'),
                    '10404' => array('text' => '度假用别墅服务'),
                    '10405' => array('text' => '运动和娱乐露营'),
                )
            ),
        )
    ),
		
		'2' => array(
				'text'=>'专业销售',
				'sub'=>array(
						'201' => array(
								'text' => '办公用品',
								'sub' => array(
										'20101' => array('text' => '未列入其他代码的商用器材'),
										'20102' => array('text' => '文具及办公用品'),
										'20103' => array('text' => '打字设备、打印复印机、扫描仪'),
								)
						),
						'202' => array(
								'text' => '工业产品',
								'sub' => array(
										'20201' => array('text' => '电气产品和设备'),
										'20202' => array('text' => '工业设备和制成品'),
										'20203' => array('text' => '其他工业耐用品'),
										'20204' => array('text' => '化工产品'),
										'20205' => array('text' => '石油及石油产品（批发商）'),
										'20206' => array('text' => '其他工业原料和消耗品'),
								)
						),
						'203' => array(
								'text' => '汽车和运输工具',
								'sub' => array(
										'20301' => array('text' => '汽车销售'),
										'20302' => array('text' => '二手车销售'),
										'20303' => array('text' => '汽车零配件'),
										'20304' => array('text' => '加油卡、加油服务'),
										'20305' => array('text' => '摩托车及配件'),
										'20306' => array('text' => '电动车及配件'),
								)
						),
						'204' => array(
								'text' => '药品医疗',
								'sub' => array(
										'20401' => array('text' => '医疗器械'),
										'20402' => array('text' => '药品、药品经营者（批发商）'),
										'20403' => array('text' => '药物'),
										'20404' => array('text' => '康复和身体辅助用品'),
								)
						),
				)
		),
		
		
		'3' => array(
				'text'=>'生活百货',
				'sub'=>array(
						'301' => array(
								'text' => '美妆珠宝配饰',
								'sub' => array(
										'30101' => array('text' => '珠宝和金银饰品'),
										'30102' => array('text' => '钟表店'),
										'30103' => array('text' => '化妆品'),
										'30104' => array('text' => '男士用品：剃须刀、烟酒具、瑞士军刀'),
								)
						),
						'302' => array(
								'text' => '母婴玩具',
								'sub' => array(
										'30201' => array('text' => '母婴用品'),
										'30202' => array('text' => '玩具、游戏用品'),
								)
						),
						'303' => array(
								'text' => '家居家纺建材',
								'sub' => array(
										'30301' => array('text' => '大型仓储式家庭用品卖场'),
										'30302' => array('text' => '木材与建材商店'),
										'30303' => array('text' => '家用五金工具'),
										'30304' => array('text' => '草坪和花园用品'),
										'30305' => array('text' => '家具/家庭摆设'),
										'30306' => array('text' => '窗帘、帷幕、室内装潢'),
										'30307' => array('text' => '各种家庭装饰专营'),
										'30308' => array('text' => '家用纺织品'),
								)
						),
						'304' => array(
								'text' => '百货商城',
								'sub' => array(
										'30401' => array('text' => '国外代购及免税店'),
										'30402' => array('text' => '平台类综合商城'),
										'30403' => array('text' => '杂货店'),
										'30404' => array('text' => '其他综合零售'),
										'30405' => array('text' => '超市（非平台类）'),
										'30406' => array('text' => '成人用品/避孕用品/情趣内衣'),
										'30407' => array('text' => '油品燃料经销'),
										'30408' => array('text' => '烟花爆竹'),
										'30409' => array('text' => '其他专业零售店'),
								)
						),
						'305' => array(
								'text' => '饮食保健',
								'sub' => array(
										'30501' => array('text' => '肉、禽、蛋及水产品'),
										'30502' => array('text' => '糖果及坚果商店'),
										'30503' => array('text' => '保健品'),
										'30504' => array('text' => '其他食品零售'),
										'30505' => array('text' => '宴会提供商'),
										'30506' => array('text' => '餐厅、订餐服务'),
										'30507' => array('text' => '酒类'),
										'30508' => array('text' => '烟草/雪茄'),
								)
						),
						'306' => array(
								'text' => '服饰鞋包',
								'sub' => array(
										'30601' => array('text' => '男性服饰'),
										'30602' => array('text' => '女性成衣'),
										'30603' => array('text' => '配饰商店'),
										'30604' => array('text' => '内衣/家居服'),
										'30605' => array('text' => '鞋类'),
										'30606' => array('text' => '高档时装及奢侈品'),
										'30607' => array('text' => '假发等饰品'),
										'30608' => array('text' => '各类服装及饰物'),
										'30609' => array('text' => '行李箱包'),
								)
						),
						'307' => array(
								'text' => '数码家电',
								'sub' => array(
										'30701' => array('text' => '手机、通讯设备销售'),
										'30702' => array('text' => '商用计算机及服务器'),
										'30703' => array('text' => '家用电器'),
										'30704' => array('text' => '数码产品及配件'),
										'30705' => array('text' => '专业摄影器材'),
								)
						),
						'308' => array(
								'text' => '运动户外',
								'sub' => array(
										'30801' => array('text' => '运动服饰'),
										'30802' => array('text' => '自行车及配件'),
										'30803' => array('text' => '体育用品/器材'),
								)
						),
						'309' => array(
								'text' => '图书音像',
								'sub' => array(
										'30901' => array('text' => '音像制品'),
										'30902' => array('text' => '书籍'),
										'30903' => array('text' => '报纸、杂志'),
								)
						),
						'310' => array(
								'text' => '文化玩乐宠物',
								'sub' => array(
										'31001' => array('text' => '乐器'),
										'31002' => array('text' => '旧商品店、二手商品店'),
										'31003' => array('text' => '文物古董'),
										'31004' => array('text' => '古玩复制品（赝品）'),
										'31005' => array('text' => '礼品、卡片、纪念品'),
										'31006' => array('text' => '工艺美术用品'),
										'31007' => array('text' => '艺术品和画廊'),
										'31008' => array('text' => '邮票/纪念币'),
										'31009' => array('text' => '宗教物品'),
										'31010' => array('text' => '花店'),
										'31011' => array('text' => '宠物及宠物用品'),
										'31012' => array('text' => '家用电子游戏'),
								)
						),
				)
		),
		
		'4' => array(
				'text'=>'网络虚拟',
				'sub'=>array(
						'401' => array(
								'text' => '娱乐票务',
								'sub' => array(
										'40101' => array('text' => '艺术创作服务'),
										'40102' => array('text' => '电影院及电影票'),
										'40103' => array('text' => '演出票务服务'),
										'40104' => array('text' => '体育场馆'),
										'40105' => array('text' => '展览和艺术场馆'),
										'40106' => array('text' => '高尔夫球场'),
										'40107' => array('text' => '游乐园、马戏团、嘉年华'),
										'40108' => array('text' => '健身和运动俱乐部'),
										'40109' => array('text' => '其他娱乐服务'),
								)
						),
						'402' => array(
								'text' => '数娱网游',
								'sub' => array(
										'40201' => array('text' => '网络游戏点卡、渠道代理'),
										'40202' => array('text' => '游戏系统商'),
										'40203' => array('text' => '网游周边服务、交易平台'),
										'40204' => array('text' => '网游运营商（含网页游戏）'),
								)
						),
						'403' => array(
								'text' => '彩票',
								'sub' => array(
										'40301' => array('text' => '彩票'),
								)
						),
						'404' => array(
								'text' => '电信通讯',
								'sub' => array(
										'40401' => array('text' => '电信运营商'),
										'40402' => array('text' => '话费充值与缴费'),
										'40403' => array('text' => '付费电视'),
								)
						),
						'405' => array(
								'text' => '互联网服务',
								'sub' => array(
										'40501' => array('text' => '互联网IDC服务'),
										'40502' => array('text' => '计算机软件'),
										'40503' => array('text' => '软件系统商'),
										'40504' => array('text' => '网络论坛'),
										'40505' => array('text' => '门户网站'),
										'40506' => array('text' => '信息检索服务（信息平台）'),
										'40507' => array('text' => '网站设计、推广'),
										'40508' => array('text' => 'SNS社交网站'),
										'40509' => array('text' => '休闲游戏'),
										'40510' => array('text' => '在线文学类'),
										'40511' => array('text' => '手机图铃'),
										'40512' => array('text' => '其他在线应用或综合类'),
										'40513' => array('text' => '视频点播'),
								)
						),
				)
		),
		
		
		'5' => array(
				'text'=>'专业服务',
				'sub'=>array(
						'501' => array(
								'text' => '医疗服务',
								'sub' => array(
										'50101' => array('text' => '社区医疗服务机构、诊所等'),
										'50102' => array('text' => '眼镜店'),
										'50103' => array('text' => '护理和照料服务'),
										'50104' => array('text' => '公立医院'),
										'50105' => array('text' => '其他医疗保健服务'),
								)
						),
						'502' => array(
								'text' => '教育服务',
								'sub' => array(
										'50201' => array('text' => '大学与学院'),
										'50202' => array('text' => '职业技能培训'),
										'50203' => array('text' => '其他学校和教育服务'),
										'50204' => array('text' => '儿童保育服务（含学前教育）'),
								)
						),
						'503' => array(
								'text' => '社会组织',
								'sub' => array(
										'50301' => array('text' => '慈善和社会公益服务'),
										'50302' => array('text' => '行业协会和专业社团'),
										'50303' => array('text' => '政府机构'),
										'50304' => array('text' => '汽车协会'),
										'50305' => array('text' => '其他会员组织'),
								)
						),
						'504' => array(
								'text' => '专业咨询',
								'sub' => array(
										'50401' => array('text' => '法律咨询和律师事务所'),
										'50402' => array('text' => '建筑、工程和测量服务'),
										'50403' => array('text' => '装修、装潢、园艺'),
										'50404' => array('text' => '会计、审计、财务服务'),
										'50405' => array('text' => '其他专业服务'),
								)
						),
						'505' => array(
								'text' => '政府服务',
								'sub' => array(
										'50501' => array('text' => '行政费用和罚款'),
								)
						),
						'506' => array(
								'text' => '其他',
								'sub' => array(
										'50601' => array('text' => '站内清算'),
								)
						),
				)
		),
		
		
		'6' => array(
				'text'=>'商业及生活服务',
				'sub'=>array(
						'601' => array(
								'text' => '承包商（农业、建筑、出版）',
								'sub' => array(
										'60101' => array('text' => '兽医服务'),
										'60102' => array('text' => '景观美化和园艺服务'),
										'60103' => array('text' => '其他工程承包商'),
								)
						),
						'602' => array(
								'text' => '房地产',
								'sub' => array(
										'60201' => array('text' => '房地产开发商'),
										'60202' => array('text' => '不动产管理-物业管理'),
										'60203' => array('text' => '不动产代理-房地产经纪'),
								)
						),
						'603' => array(
								'text' => '直销',
								'sub' => array(
										'60301' => array('text' => '上门直销（直销员）'),
										'60302' => array('text' => '目录直销平台'),
										'60303' => array('text' => '直销代理'),
										'60304' => array('text' => '直销'),
								)
						),
						'604' => array(
								'text' => '金融服务',
								'sub' => array(
										'60401' => array('text' => '金融机构-商业银行服务'),
										'60402' => array('text' => '金融机构-自动现金服务'),
										'60403' => array('text' => '贵金属投资'),
										'60404' => array('text' => '外币汇兑'),
										'60405' => array('text' => '证券期货基金'),
										'60406' => array('text' => '保险公司'),
										'60407' => array('text' => '保险代理'),
										'60408' => array('text' => '个人资金借贷'),
								)
						),
						'605' => array(
								'text' => '商业服务',
								'sub' => array(
										'60501' => array('text' => '出版印刷服务'),
										'60502' => array('text' => '刻板排版服务'),
										'60503' => array('text' => '广告服务'),
										'60504' => array('text' => '征信和信用报告咨询服务'),
										'60505' => array('text' => '复印及绘图服务'),
										'60506' => array('text' => '文字处理/翻译速记'),
										'60507' => array('text' => '猎头、职业中介'),
										'60508' => array('text' => '公关和企业管理服务'),
										'60509' => array('text' => '保安和监控服务'),
										'60510' => array('text' => '其他商业服务'),
								)
						),
						'606' => array(
								'text' => '公共事业',
								'sub' => array(
										'60601' => array('text' => '公共事业（电、气、水）'),
										'60602' => array('text' => '公共事业-电力缴费'),
										'60603' => array('text' => '公共事业-煤气缴费'),
										'60604' => array('text' => '公共事业-自来水缴费'),
								)
						),
						'607' => array(
								'text' => '团购',
								'sub' => array(
										'60701' => array('text' => '团购及折扣店'),
								)
						),
						'608' => array(
								'text' => '生活服务',
								'sub' => array(
										'60801' => array('text' => '摄影服务'),
										'60802' => array('text' => '婚介服务'),
										'60803' => array('text' => '婚庆服务'),
										'60804' => array('text' => '导购、经纪和拍卖服务'),
										'60805' => array('text' => '家政服务'),
										'60806' => array('text' => '美容SPA和美体保健'),
										'60807' => array('text' => '其他生活服务'),
								)
						),
						'609' => array(
								'text' => '维修服务',
								'sub' => array(
										'60901' => array('text' => '各类维修相关服务'),
								)
						),
						'610' => array(
								'text' => '汽车租赁和服务',
								'sub' => array(
										'61001' => array('text' => '汽车出租'),
										'61002' => array('text' => '汽车维修、保养、美容装饰'),
								)
						),
				)
		),
);



