<?php
include('config.php');
define('FX_STATIC_IMAGES', Yii::app() -> theme -> baseUrl.'/fx/images/');//图片地址
define('FX_STATIC_STYLES',Yii::app() -> theme -> baseUrl.'/fx/styles/');//样式地址
define('FX_STATIC_JS',Yii::app() -> theme -> baseUrl.'/fx/js/');//JS地址

define('GJ_STATIC_IMAGES', Yii::app() -> theme -> baseUrl.'/gj/images/');//图片地址
define('GJ_STATIC_STYLES',Yii::app() -> theme -> baseUrl.'/gj/styles/');//样式地址
define('GJ_STATIC_JS',Yii::app() -> theme -> baseUrl.'/gj/js/');//JS地址

define('MGR_STATIC_IMAGES', Yii::app() -> theme -> baseUrl.'/mgr/images/');//图片地址
define('MGR_STATIC_STYLES',Yii::app() -> theme -> baseUrl.'/mgr/styles/');//样式地址
define('MGR_STATIC_JS',Yii::app() -> theme -> baseUrl.'/mgr/js/');//JS地址

define('USER_STATIC_IMAGES', Yii::app() -> theme -> baseUrl.'/gj/user/images/');//图片地址
define('USER_STATIC_STYLES',Yii::app() -> theme -> baseUrl.'/gj/user/styles/');//样式地址
define('USER_STATIC_JS',Yii::app() -> theme -> baseUrl.'/gj/user/js/');//JS地址

define('MOBILE_STATIC_IMAGES', Yii::app() -> theme -> baseUrl.'/gj/user/mobile/images/');//图片地址
define('MOBILE_STATIC_STYLES',Yii::app() -> theme -> baseUrl.'/gj/user/mobile/styles/');//样式地址
define('MOBILE_STATIC_JS',Yii::app() -> theme -> baseUrl.'/gj/user/mobile/js/');//JS地址

define('SYT_STATIC_IMAGES', Yii::app() -> theme -> baseUrl.'/syt/images/');//图片地址
define('SYT_STATIC_STYLES',Yii::app() -> theme -> baseUrl.'/syt/styles/');//样式地址
define('SYT_STATIC_JS',Yii::app() -> theme -> baseUrl.'/syt/js/');//JS地址

define('WWW_STATIC_IMAGES', Yii::app() -> theme -> baseUrl.'/wanquan/images/');//图片地址
define('WWW_STATIC_STYLES',Yii::app() -> theme -> baseUrl.'/wanquan/styles/');//样式地址
define('WWW_STATIC_JS',Yii::app() -> theme -> baseUrl.'/wanquan/js/');//JS地址

define('WEBSITE_STATIC_IMAGES', Yii::app() -> theme -> baseUrl.'/website/images/');//图片地址
define('WEBSITE_STATIC_STYLES',Yii::app() -> theme -> baseUrl.'/website/styles/');//样式地址
define('WEBSITE_STATIC_JS',Yii::app() -> theme -> baseUrl.'/website/js/');//JS地址

define('OA_STATIC_IMAGES', Yii::app() -> theme -> baseUrl.'/oa/images/');//图片地址
define('OA_STATIC_STYLES',Yii::app() -> theme -> baseUrl.'/oa/styles/');//样式地址
define('OA_STATIC_JS',Yii::app() -> theme -> baseUrl.'/oa/js/');//JS地址

define('WY_STATIC_IMAGES', Yii::app() -> theme -> baseUrl.'/wq/images/');//图片地址
define('WY_STATIC_STYLES',Yii::app() -> theme -> baseUrl.'/wq/styles/');//样式地址
define('WY_STATIC_JS',Yii::app() -> theme -> baseUrl.'/wq/js/');//JS地址


//相册生成缩率图
define('IMG_JKSC_THUMB','source@600*');

//商户签约参数
//预计年收入
define('YJNSR_0_8', '1');//0~8万
define('YJNSR_8_30', '2');//8~30万
define('YJNSR_30_200', '3');//30~200万
define('YJNSR_200_600', '4');//200~600万
define('YJNSR_600', '5');//600万以上
$GLOBALS['__YJNSR'] = array(
		YJNSR_0_8 => '0万~8万',
		YJNSR_8_30 => '8万~30万',
		YJNSR_30_200 => '30万~200万',
		YJNSR_200_600 => '200万~600万',
		YJNSR_600 => '600万以上'
);
//员工人数
define('YGRS_1_10', '1');//1~10人
define('YGRS_11_50', '2');//11~50人
define('YGRS_51_200', '3');//51~200人
define('YGRS_200', '4');//200人以上
$GLOBALS['__YGRS'] = array(
		YGRS_1_10 => '1~10人',
		YGRS_11_50 => '11~50人',
		YGRS_51_200 => '51~200人',
		YGRS_200 => '200人以上',
);

//是否清算类商户
define('IS_NO_QSLSH', '1');//非清算商户
define('IS_YES_QSLSH', '2');//清算商户
define('NUKNOW_QSLSH', '3');//未知
$GLOBALS['__QSLSH'] = array(
		IS_NO_QSLSH => '非清算商户',
		IS_YES_QSLSH => '清算商户',
		NUKNOW_QSLSH => '未知'
);

//签约用意
define('QYYY_DZSW', '1');//电子商务收款与支付
define('QYYY_ZJGJYDB', '2');//资金归集与调拨
define('QYYY_QT', '3');//其他
$GLOBALS['__QYYY'] = array(
		QYYY_DZSW => '电子商务收款与支付',
		QYYY_ZJGJYDB => '资金归集与调拨',
		QYYY_QT => '其他'
);
//营业场所面积
define('YECSMJ_100', '1');//100平米以下
define('YECSMJ_100_200', '2');//100-200平米
define('YECSMJ_200_500', '3');//200-500平米
define('YECSMJ_500', '4');//500平米以上
$GLOBALS['__YECSMJ'] = array(
		YECSMJ_100 => '100平米以下',
		YECSMJ_100_200 => '100-200平米',
		YECSMJ_200_500 => '200-500平米',
		YECSMJ_500 => '500平米以上'
);

//客户群体
define('KHQT_ZDSYR', '1');//终端使用人
define('KHQT_DLR', '2');//代理人
define('KHQT_SCZZS', '3');//生产制作商
define('KHQT_BHYSJZ', '4');//包含以上几种
define('KHQT_QT', '5');//其他
$GLOBALS['__KHQT'] = array(
		KHQT_ZDSYR => '终端使用人',
		KHQT_DLR => '代理人',
		KHQT_SCZZS => '生产制作商',
		KHQT_BHYSJZ => '包含以上几种',
		KHQT_QT => '其他'
);

/**************短信套餐**************/
$GLOBALS['__DXTC'] = array(
		'1' => array(
				'text' => '500条套餐',
				'sub' => array(
						'unit_price' => '0.1',
						'num' => '500'
				)
		),
		'2' => array(
				'text' => '2000条套餐',
				'sub' => array(
						'unit_price' => '0.08',
						'num' => '2000'
				)
		),
		'3' => array(
				'text' => '5000条套餐',
				'sub' => array(
						'unit_price' => '0.07',
						'num' => '5000'
				)
		),
);

/*********选择样式*********************/
$GLOBALS['__XZYS'] = array(
    '1' => array(
        'img' => 'style1.png'
    ),
    '2' => array(
        'img' => 'style2.png'
    ),
    '3' => array(
        'img' => 'style3.png'
    ),
    '4' => array(
        'img' => 'style4.png'
    ),
    '5' => array(
        'img' => 'style5.png'
    ),
    '6' => array(
        'img' => 'style6.png'
    ),
    '7' => array(
        'img' => 'style7.png'
    ),
    '8' => array(
        'img' => 'style8.png'
    ),
    '9' => array(
        'img' => 'style9.png'
    ),
);

/**************签约产品*****************/
define('CONTRACT_XXTMSD', '1');//线下条码收单
define('CONTRACT_XXSMZF', '2');//线下扫码支付
define('CONTRACT_KJSJLLQAQZF', '3');//快捷手机浏览器安全支付
define('CONTRACT_KJSJAQZF', '4');//快捷手机安全支付
define('CONTRACT_KJSJWAPZF', '5');//快捷手机wap支付
define('CONTRACT_XXSBZF', '6');//线下声波支付
$GLOBALS['__CONTRACT'] = array(
		CONTRACT_XXTMSD => '线下条码收单',
		CONTRACT_XXSMZF => '线下扫码支付',
		CONTRACT_KJSJLLQAQZF => '快捷手机浏览器安全支付',
		CONTRACT_KJSJAQZF => '快捷手机安全支付',
		CONTRACT_KJSJWAPZF => '快捷手机wap支付',
		CONTRACT_XXSBZF => '线下声波支付'
);


/******************微信商户报单-经营类目*******************************/
$GLOBALS['WECHAT_MERCHANT_JYLM'] = array(
		'1' => array(
				'text' => '企业',
				'sub' => array(
						'101' => array(
								'text' => '电商/团购',
								'sub' => array(
										'10101' => array('text' => '线上商超'),
										'10102' => array('text' => '团购'),
										'10103' => array('text' => '海淘'),
								)
						),
						'102' => array(
								'text' => '线下零售',
								'sub' => array(
										'10201' => array('text' => '百货'),
										'10202' => array('text' => '自动售卖机'),
										'10203' => array('text' => '便利店'),
										'10204' => array('text' => '超市'),
										'10205' => array('text' => '其他综合零售'),
								)
						),
						'103' => array(
								'text' => '生活/家居',
								'sub' => array(
										'10301' => array('text' => '家居/建材/装饰/布艺类商城'),
										'10302' => array('text' => '家用电器'),
										'10303' => array('text' => '计生用品'),
										'10304' => array('text' => '美妆/护肤/个人护理'),
										'10305' => array('text' => '工艺品/盆栽/室内装饰品'),
										'10306' => array('text' => '汽车/摩托/自行车/其他交通工具/配件/改装'),
								)
						),
						'104' => array(
								'text' => '餐饮/食品',
								'sub' => array(
										'10401' => array('text' => '普通食品'),
										'10402' => array('text' => '保健品/滋补品'),
										'10403' => array('text' => '餐饮'),
								)
						),
						'105' => array(
								'text' => '时尚',
								'sub' => array(
										'10501' => array('text' => '服饰类商城/服饰配件/箱包'),
										'10502' => array('text' => '礼品/鲜花/纪念品'),
										'10503' => array('text' => '户外/运动/健身器材/安防'),
										'10504' => array('text' => '乐器'),
										'10505' => array('text' => '手表/钟表/眼镜'),
										'10506' => array('text' => '黄金珠宝/钻石/玉石'),
										'10507' => array('text' => '饰品'),
								)
						),
						'106' => array(
								'text' => '生活/咨询服务',
								'sub' => array(
										'10601' => array('text' => '咨询/法律咨询/金融咨询等'),
										'10602' => array('text' => '家政/婚庆服务/摄影服务'),
										'10603' => array('text' => '印刷/维修服务/排版/刻板'),
										'10604' => array('text' => '丧葬行业'),
										'10605' => array('text' => '广告公司'),
										'10606' => array('text' => '会展服务/活动策划'),
										'10607' => array('text' => '办证/刻章'),
										'10608' => array('text' => '开锁工具'),
										'10609' => array('text' => '报社/出版社'),
										'10610' => array('text' => '电台/电视台'),
										'10611' => array('text' => '人才中介机构/招聘/猎头'),
										'10612' => array('text' => '职业社交/婚介/交友'),
										'10613' => array('text' => '网上生活服务平台'),
								)
						),
						'107' => array(
								'text' => '数码',
								'sub' => array(
										'10701' => array('text' => '数码产品'),
										'10702' => array('text' => '办公设备'),
								)
						),
						'108' => array(
								'text' => '机票/旅游',
								'sub' => array(
										'10801' => array('text' => '旅行社'),
										'10802' => array('text' => '旅游服务平台'),
										'10803' => array('text' => '航空公司'),
										'10804' => array('text' => '机票代理'),
										'10805' => array('text' => '旅馆/酒店/景区/度假区'),
								)
						),
						'109' => array(
								'text' => '网络虚拟服务',
								'sub' => array(
										'10901' => array('text' => '门户/咨询/论坛'),
										'10902' => array('text' => '视频/网络小说/在线图书/音乐'),
										'10903' => array('text' => '域名/建站/主机/代码'),
										'10904' => array('text' => '搜索引擎/网络广告/网络推广/视频制作'),
										'10905' => array('text' => '游戏/点卡/金币'),
								)
						),
						'110' => array(
								'text' => '软件',
								'sub' => array(
										'11001' => array('text' => '软件'),
								)
						),
						'111' => array(
								'text' => '教育/培训',
								'sub' => array(
										'11101' => array('text' => '教育/培训/考试缴费/学费'),
										'11102' => array('text' => '私立院校'),
								)
						),
						'112' => array(
								'text' => '机械/电子',
								'sub' => array(
										'11201' => array('text' => '保健器械'),
										'11202' => array('text' => '医疗器械'),
										'11203' => array('text' => '电子元器件/仪器仪表/机械设备及配件'),
								)
						),
						'113' => array(
								'text' => '母婴/玩具',
								'sub' => array(
										'11301' => array('text' => '母婴用品/儿童玩具'),
										'11302' => array('text' => '母婴类商城'),
								)
						),
						'114' => array(
								'text' => '娱乐/健身服务',
								'sub' => array(
										'11401' => array('text' => '美容/健身类会所'),
										'11402' => array('text' => '俱乐部/高尔夫球场/休闲会所'),
										'11403' => array('text' => '游艺厅/KTV/网吧'),
								)
						),
						'115' => array(
								'text' => '医疗',
								'sub' => array(
										'11501' => array('text' => '药品'),
										'11502' => array('text' => '保健信息咨询/心理咨询/体检卡'),
										'11503' => array('text' => '私立/民营医院/诊所'),
										'11504' => array('text' => '挂号平台'),
										'11505' => array('text' => '亲子鉴定/催眠'),
										'11506' => array('text' => '中草药原材料'),
								)
						),
						'116' => array(
								'text' => '票务',
								'sub' => array(
										'11601' => array('text' => '影票/演唱会/赛事娱乐等票务'),
										'11602' => array('text' => '火车票/船票/车票等交通票务'),
								)
						),
						'117' => array(
								'text' => '平台商',
								'sub' => array(
										'11701' => array('text' => '平台商'),
								)
						),
						'118' => array(
								'text' => '书籍/音像/文具',
								'sub' => array(
										'11801' => array('text' => '书籍/音像'),
										'11802' => array('text' => '文具'),
								)
						),
						'119' => array(
								'text' => '房地产',
								'sub' => array(
										'11901' => array('text' => '房产预售'),
										'11902' => array('text' => '房屋中介'),
								)
						),
						'120' => array(
								'text' => '收藏/宠物',
								'sub' => array(
										'12001' => array('text' => '宠物/宠物食品'),
										'12002' => array('text' => '非文物类收藏品'),
										'12003' => array('text' => '文物经营'),
										'12004' => array('text' => '文物拍卖'),
										'12005' => array('text' => '文物复制品销售/典当'),
								)
						),
						'121' => array(
								'text' => '苗木/绿化',
								'sub' => array(
										'12101' => array('text' => '苗木种植'),
										'12102' => array('text' => '园林绿化'),
										'12103' => array('text' => '化肥/农用药剂等'),
								)
						),
						'122' => array(
								'text' => '交通运输服务类',
								'sub' => array(
										'12201' => array('text' => '铁路货物运输'),
										'12202' => array('text' => '道路运输'),
										'12203' => array('text' => '水路运输'),
										'12204' => array('text' => '海运'),
										'12205' => array('text' => '港口经营港口理货'),
										'12206' => array('text' => '航空运输'),
										'12207' => array('text' => '租车'),
								)
						),
						'123' => array(
								'text' => '其他生活缴费',
								'sub' => array(
										'12301' => array('text' => '有线电视缴费'),
										'12302' => array('text' => '停车场'),
										'12303' => array('text' => '物业管理费'),
										'12304' => array('text' => '城市交通卡缴费'),
										'12305' => array('text' => '其他生活缴费'),
								)
						),
						'124' => array(
								'text' => '公益',
								'sub' => array(
										'12401' => array('text' => '公益'),
								)
						),
						'125' => array(
								'text' => '装饰',
								'sub' => array(
										'12501' => array('text' => '室内装饰设计服务'),
								)
						),
						'126' => array(
								'text' => '保险',
								'sub' => array(
										'12601' => array('text' => '保险公司'),
										'12602' => array('text' => '保险代理公司'),
										'12603' => array('text' => '保险经纪公司'),
										'12604' => array('text' => '保险公估公司'),
										'12605' => array('text' => '保险兼业代理公司'),
								)
						),
						'127' => array(
								'text' => '通信',
								'sub' => array(
										'12701' => array('text' => '电信运营商'),
										'12702' => array('text' => '宽带收费'),
										'12703' => array('text' => '话费通讯'),
								)
						),
						'128' => array(
								'text' => '金融',
								'sub' => array(
										'12801' => array('text' => '财经资讯'),
										'12802' => array('text' => '股票软件类'),
								)
						),
						'129' => array(
								'text' => '快递/货运服务',
								'sub' => array(
										'12901' => array('text' => '物流/快递公司'),
								)
						),
						'130' => array(
								'text' => '众筹',
								'sub' => array(
										'13001' => array('text' => '众筹'),
								)
						),
						'131' => array(
								'text' => '彩票',
								'sub' => array(
										'13101' => array('text' => '彩票'),
								)
						),
						'132' => array(
								'text' => '直销',
								'sub' => array(
										'13201' => array('text' => '直销业务'),
								)
						),
						'133' => array(
								'text' => '公共事业缴费',
								'sub' => array(
										'13301' => array('text' => '水电煤缴费/交通罚款等生活缴费'),
								)
						),
						'134' => array(
								'text' => '预付卡',
								'sub' => array(
										'13401' => array('text' => '单用途预付卡'),
								)
						),
						'135' => array(
								'text' => '数字娱乐',
								'sub' => array(
										'13501' => array('text' => '彩铃'),
								)
						),
						'136' => array(
								'text' => '其他',
								'sub' => array(
										'13601' => array('text' => '其他行业'),
								)
						),
				)
		),
		'2' => array(
				'text' => '个体工商户',
				'sub' => array(
						'201' => array(
								'text' => '餐饮/食品',
								'sub' => array(
										'20101' => array('text' => '普通食品'),
										'20102' => array('text' => '保健品/滋补品'),
										'20103' => array('text' => '餐饮'),
								)
						),
						'202' => array(
								'text' => '线下零售',
								'sub' => array(
										'20201' => array('text' => '其他综合零售'),
										'20202' => array('text' => '便利店'),
								)
						),
						'203' => array(
								'text' => '生活/家居',
								'sub' => array(
										'20301' => array('text' => '家居/建材/装饰/布艺类商城'),
										'20302' => array('text' => '家用电器'),
										'20303' => array('text' => '计生用品'),
										'20304' => array('text' => '美妆/护肤/个人护理'),
										'20305' => array('text' => '工艺品/盆栽/室内装饰品'),
										'20306' => array('text' => '汽车/摩托/自行车/其他交通工具/配件/改装'),
								)
						),
						'204' => array(
								'text' => '时尚',
								'sub' => array(
										'20401' => array('text' => '服装类商城/服饰配件/箱包'),
										'20402' => array('text' => '礼品/鲜花/纪念品'),
										'20403' => array('text' => '户外/运动/健身器材/安防'),
										'20404' => array('text' => '乐器'),
										'20405' => array('text' => '手表/钟表/眼镜'),
										'20406' => array('text' => '黄金珠宝/钻石/玉石'),
										'20407' => array('text' => '饰品'),
								)
						),
						'205' => array(
								'text' => '生活/咨询服务',
								'sub' => array(
										'20501' => array('text' => '广告公司'),
										'20502' => array('text' => '会展服务/活动策划'),
										'20503' => array('text' => '办证/刻章'),
										'20504' => array('text' => '开锁工具'),
										'20505' => array('text' => '咨询/法律咨询/金融咨询等'),
										'20506' => array('text' => '家政/婚庆服务/摄影服务'),
										'20507' => array('text' => '印刷/维修服务/排版/刻板'),
										'20508' => array('text' => '丧葬行业'),
										'20509' => array('text' => '人才中介机构/招聘/猎头'),
										'20510' => array('text' => '职业社交/婚介/交友'),
								)
						),
						'206' => array(
								'text' => '数码',
								'sub' => array(
										'20601' => array('text' => '数码产品'),
										'20602' => array('text' => '办公设备'),
								)
						),
						'207' => array(
								'text' => '娱乐/健身服务',
								'sub' => array(
										'20701' => array('text' => '俱乐部/高尔夫球场/休闲会所'),
										'20702' => array('text' => '美容/健身类会所'),
										'20703' => array('text' => '游艺厅/KTV/网吧'),
								)
						),
						'208' => array(
								'text' => '母婴/玩具',
								'sub' => array(
										'20801' => array('text' => '母婴用品/儿童玩具'),
										'20802' => array('text' => '母婴类商城'),
								)
						),
						'209' => array(
								'text' => '母婴/玩具',
								'sub' => array(
										'20901' => array('text' => '旅行社'),
										'20902' => array('text' => '机票代理'),
										'20903' => array('text' => '旅馆/酒店/景区/度假区'),
								)
						),
						'210' => array(
								'text' => '书籍/音像/文具',
								'sub' => array(
										'21001' => array('text' => '书籍/音像'),
										'21002' => array('text' => '文具'),
								)
						),
						'211' => array(
								'text' => '机械/电子',
								'sub' => array(
										'21101' => array('text' => '保健器械'),
										'21102' => array('text' => '医疗器械'),
										'21103' => array('text' => '电子元器件/仪器仪表/机械设备及配件'),
								)
						),
						'212' => array(
								'text' => '网络虚拟服务',
								'sub' => array(
										'21201' => array('text' => '游戏/点卡/金币'),
										'21202' => array('text' => '搜索引擎/网络广告/网络推广/视频制作'),
										'21203' => array('text' => '域名/建站/主机/代码'),
										'21204' => array('text' => '门户/咨询/论坛'),
										'21205' => array('text' => '视频/网络小说/在线图书/音乐'),
								)
						),
						'213' => array(
								'text' => '软件',
								'sub' => array(
										'21301' => array('text' => '软件'),
								)
						),
						'214' => array(
								'text' => '教育/培训',
								'sub' => array(
										'21401' => array('text' => '私立院校'),
										'21402' => array('text' => '教育/培训/考试缴费/学费'),
								)
						),
						'215' => array(
								'text' => '医疗',
								'sub' => array(
										'21501' => array('text' => '药品'),
										'21502' => array('text' => '保健信息咨询/心理咨询/体检卡'),
										'21503' => array('text' => '私立/民营医院/诊所'),
										'21504' => array('text' => '亲子鉴定/催眠'),
								)
						),
						'216' => array(
								'text' => '房地产',
								'sub' => array(
										'21601' => array('text' => '房屋中介'),
								)
						),
						'217' => array(
								'text' => '宠物/收藏',
								'sub' => array(
										'21701' => array('text' => '文物经营'),
										'21702' => array('text' => '文物拍卖'),
										'21703' => array('text' => '文物复制品销售/典当'),
										'21704' => array('text' => '宠物/宠物食品'),
										'21705' => array('text' => '非文物类收藏品'),
								)
						),
						'218' => array(
								'text' => '装饰',
								'sub' => array(
										'21801' => array('text' => '室内装饰设计服务'),
								)
						),
						'219' => array(
								'text' => '苗木/绿化',
								'sub' => array(
										'21901' => array('text' => '苗木种植'),
										'21902' => array('text' => '园林绿化'),
								)
						),
						'220' => array(
								'text' => '票务',
								'sub' => array(
										'22001' => array('text' => '影票/演唱会/赛事娱乐等票务'),
										'22002' => array('text' => '火车票/船票/车票等交通票务'),
								)
						),
						'221' => array(
								'text' => '交通运输服务类',
								'sub' => array(
										'22101' => array('text' => '铁路货物运输'),
										'22102' => array('text' => '道路运输'),
										'22103' => array('text' => '水路运输'),
										'22104' => array('text' => '海运'),
										'22105' => array('text' => '港口经营港口理货'),
										'22106' => array('text' => '航空运输'),
										'22107' => array('text' => '租车'),
								)
						),
						'222' => array(
								'text' => '通信',
								'sub' => array(
										'22201' => array('text' => '宽带收费'),
										'22202' => array('text' => '话费通讯'),
								)
						),
						'223' => array(
								'text' => '保险',
								'sub' => array(
										'22301' => array('text' => '保险代理公司'),
										'22302' => array('text' => '保险经纪公司'),
										'22303' => array('text' => '保险公估公司'),
										'22304' => array('text' => '保险兼业代理公司'),
								)
						),
						'224' => array(
								'text' => '公共事业缴费',
								'sub' => array(
										'22401' => array('text' => '水电煤缴费/交通罚款等生活缴费'),
								)
						),
						'225' => array(
								'text' => '其他生活缴费',
								'sub' => array(
										'22501' => array('text' => '停车场'),
										'22502' => array('text' => '物业管理费'),
										'22503' => array('text' => '城市交通卡缴费'),
										'22504' => array('text' => '其他生活缴费'),
										'22505' => array('text' => '有线电视缴费'),
								)
						),
						'226' => array(
								'text' => '金融',
								'sub' => array(
										'22601' => array('text' => '财经资讯'),
										'22602' => array('text' => '股票软件类'),
								)
						),
						'227' => array(
								'text' => '快递/货运服务',
								'sub' => array(
										'22701' => array('text' => '物流/快递公司'),
								)
						),
						'228' => array(
								'text' => '彩票',
								'sub' => array(
										'22801' => array('text' => '彩票'),
								)
						),
						'229' => array(
								'text' => '数字娱乐',
								'sub' => array(
										'22901' => array('text' => '彩铃'),
								)
						),
						'230' => array(
								'text' => '其他',
								'sub' => array(
										'23001' => array('text' => '其他行业'),
								)
						),
				)
		),
		'3' => array(
				'text' => '事业单位',
				'sub' => array(
						'301' => array(
								'text' => '医疗',
								'sub' => array(
										'30101' => array('text' => '药品'),
										'30102' => array('text' => '保健信息咨询/心理咨询/体检卡'),
										'30103' => array('text' => '公立医院'),
										'30104' => array('text' => '挂号平台'),
								)
						),
						'302' => array(
								'text' => '公共事业缴费',
								'sub' => array(
										'30201' => array('text' => '水电煤缴费/交通罚款等生活缴费'),
										'30202' => array('text' => '事业单位'),
								)
						),
						'303' => array(
								'text' => '教育/培训',
								'sub' => array(
										'30301' => array('text' => '公立院校'),
								)
						),
						'304' => array(
								'text' => '生活/咨询服务',
								'sub' => array(
										'30401' => array('text' => '报社/出版社'),
										'30402' => array('text' => '电台/电视台'),
								)
						),
						'305' => array(
								'text' => '机票/旅游',
								'sub' => array(
										'30501' => array('text' => '旅游服务平台'),
										'30502' => array('text' => '旅馆/酒店/景区/度假区'),
								)
						),
						'306' => array(
								'text' => '交通运输服务类',
								'sub' => array(
										'30601' => array('text' => '铁路货物运输'),
										'30602' => array('text' => '道路运输'),
										'30603' => array('text' => '水路运输'),
										'30604' => array('text' => '海运'),
										'30605' => array('text' => '港口经营港口理货'),
										'30606' => array('text' => '航空运输'),
										'30607' => array('text' => '租车'),
								)
						),
						'307' => array(
								'text' => '其他生活缴费',
								'sub' => array(
										'30701' => array('text' => '有线电视缴费'),
										'30702' => array('text' => '停车场'),
										'30703' => array('text' => '物业管理费'),
										'30704' => array('text' => '城市交通卡缴费'),
										'30705' => array('text' => '其他生活缴费'),
								)
						),
						'308' => array(
								'text' => '票务',
								'sub' => array(
										'30801' => array('text' => '火车票/船票/车票等交通票务'),
								)
						),
						'309' => array(
								'text' => '快递/货运服务',
								'sub' => array(
										'30901' => array('text' => '物流/快递公司'),
								)
						),
				)
		),
);

//开户行城市
$GLOBALS['BANK_AREA'] = array(
		'01' => array(
			'province' => "北京市",
			'city' => array(
				'0101' => "北京",
			),
		),
		'02' => array(
			'province' => "上海市",
			'city' => array(
				'0201' => "上海",
			),
		),
		'03' => array(
			'province' => "天津市",
			'city' => array(
				'0301' => "天津",
			),
		),
		'05' => array(
			'province' => "重庆市",
			'city' => array(
				'0501' => "重庆",
				'0502' => "涪陵市",
				'0503' => "万州市",
				'0504' => "黔江市",
			),
		),
		'06' => array(
			'province' => "河北省",
			'city' => array(
				'0601' => "石家庄",
				'0602' => "张家口",
				'0603' => "承德",
				'0604' => "秦皇岛",
				'0605' => "唐山",
				'0606' => "廊坊",
				'0607' => "保定",
				'0608' => "沧州",
				'0609' => "衡水",
				'0610' => "邢台",
				'0611' => "邯郸",
			),
		),
		'07' => array(
			'province' => "山西省",
			'city' => array(
				'0701' => "太原",
				'0702' => "大同",
				'0703' => "朔州",
				'0704' => "阳泉",
				'0705' => "长治",
				'0706' => "晋城",
				'0707' => "忻州",
				'0708' => "离石",
				'0709' => "晋中",
				'0710' => "榆次",
				'0711' => "临汾",
				'0712' => "运城",
				'0713' => "吕梁",
			),
		),
		'08' => array(
			'province' => "内蒙古自治区",
			'city' => array(
				'0801' => "呼和浩特",
				'0802' => "包头",
				'0803' => "乌海",
				'0804' => "赤峰",
				'0805' => "海拉尔",
				'0806' => "乌兰浩特",
				'0807' => "通辽",
				'0808' => "锡林浩特",
				'0809' => "集宁",
				'0810' => "东胜",
				'0811' => "临河",
				'0812' => "阿拉善左旗",
				'0813' => "巴彦扎尔",
				'0814' => "鄂尔多斯",
				'0815' => "呼伦贝尔",
				'0816' => "乌兰察布",
				'0817' => "锡林郭勒盟",
				'0818' => "兴安盟",
			),
		),
		'09' => array(
			'province' => "辽宁省",
			'city' => array(
				'0901' => "沈阳",
				'0902' => "朝阳",
				'0903' => "阜新",
				'0904' => "铁岭",
				'0905' => "抚顺",
				'0906' => "本溪",
				'0907' => "辽阳",
				'0908' => "鞍山",
				'0909' => "丹东",
				'0910' => "大连",
				'0911' => "营口",
				'0912' => "盘锦",
				'0913' => "锦州",
				'0914' => "葫芦岛",
			),
		),
		'10' => array(
			'province' => "吉林省",
			'city' => array(
				'1001' => "长春",
				'1002' => "白城",
				'1003' => "松原",
				'1004' => "吉林",
				'1005' => "四平",
				'1006' => "辽源",
				'1007' => "通化",
				'1008' => "白山",
				'1009' => "延吉",
				'1010' => "延边州",
			),
		),
		'11' => array(
			'province' => "黑龙江省",
			'city' => array(
				'1101' => "哈尔滨",
				'1102' => "齐齐哈尔",
				'1103' => "黑河",
				'1104' => "大庆",
				'1105' => "伊春",
				'1106' => "鹤岗",
				'1107' => "佳木斯",
				'1108' => "双鸭山",
				'1109' => "七台河",
				'1110' => "鸡西",
				'1111' => "牡丹江",
				'1112' => "绥化",
				'1113' => "加格达奇",
				'1114' => "大兴安岭地区",
			),
		),
		'12' => array(
			'province' => "江苏省",
			'city' => array(
				'1201' => "南京",
				'1202' => "苏州",
				'1203' => "徐州",
				'1204' => "连云港",
				'1205' => "宿迁",
				'1206' => "淮安",
				'1207' => "盐城",
				'1208' => "扬州",
				'1209' => "泰州",
				'1210' => "南通",
				'1211' => "镇江",
				'1212' => "常州",
				'1213' => "无锡",
			),
		),
		'13' => array(
			'province' => "浙江省",
			'city' => array(
				'1301' => "杭州",
				'1302' => "湖州",
				'1303' => "嘉兴",
				'1304' => "舟山",
				'1305' => "宁波",
				'1306' => "绍兴",
				'1307' => "金华",
				'1308' => "台州",
				'1309' => "温州",
				'1310' => "丽水",
				'1311' => "衢州",
			),
		),
		'14' => array(
			'province' => "安徽省",
			'city' => array(
				'1401' => "合肥",
				'1402' => "宿州",
				'1403' => "淮北",
				'1404' => "阜阳",
				'1405' => "蚌埠",
				'1405' => "淮南",
				'1406' => "滁州",
				'1407' => "马鞍山",
				'1408' => "芜湖",
				'1409' => "铜陵",
				'1410' => "安庆",
				'1411' => "黄山",
				'1412' => "六安",
				'1413' => "巢湖",
				'1414' => "贵池",
				'1415' => "宣城",
				'1416' => "亳州",
			),
		),
		'15' => array(
			'province' => "福建省",
			'city' => array(
				'1501' => "福州",
				'1502' => "南平",
				'1503' => "三明",
				'1504' => "莆田",
				'1505' => "泉州",
				'1506' => "厦门",
				'1506' => "漳州",
				'1507' => "龙岩",
				'1508' => "宁德",
				'1509' => "福安",
				'1510' => "邵武",
				'1511' => "石狮",
				'1512' => "永安",
				'1513' => "武夷山",
				'1514' => "福清",
			),
		),
		'16' => array(
			'province' => "江西省",
			'city' => array(
				'1601' => "南昌",
				'1602' => "九江",
				'1603' => "景德镇",
				'1604' => "鹰潭",
				'1605' => "新余",
				'1606' => "萍乡",
				'1607' => "赣州",
				'1608' => "上饶",
				'1609' => "临川",
				'1610' => "宜春",
				'1611' => "吉安",
				'1612' => "抚州",
			),
		),
		'17' => array(
			'province' => "山东省",
			'city' => array(
				'1701' => "济南",
				'1702' => "聊城",
				'1703' => "德州",
				'1704' => "东营",
				'1705' => "淄博",
				'1706' => "潍坊",
				'1707' => "烟台",
				'1708' => "威海",
				'1709' => "青岛",
				'1710' => "日照",
				'1711' => "临沂",
				'1712' => "枣庄",
				'1713' => "济宁",
				'1714' => "泰安",
				'1715' => "莱芜",
				'1716' => "滨州",
				'1717' => "菏泽",
			),
		),
		'18' => array(
			'province' => "河南省",
			'city' => array(
				'1801' => "郑州",
				'1802' => "三门峡",
				'1803' => "洛阳",
				'1804' => "焦作",
				'1805' => "新乡",
				'1806' => "鹤壁",
				'1807' => "安阳",
				'1808' => "濮阳",
				'1809' => "开封",
				'1810' => "商丘",
				'1811' => "许昌",
				'1812' => "漯河",
				'1813' => "平定山",
				'1814' => "南阳",
				'1815' => "信阳",
				'1816' => "济源",
				'1817' => "周口",
				'1818' => "驻马店",
			),
		),
		'19' => array(
			'province' => "湖北省",
			'city' => array(
				'1901' => "武汉",
				'1902' => "十堰",
				'1903' => "襄樊",
				'1904' => "荆门",
				'1905' => "孝感",
				'1906' => "黄冈",
				'1907' => "鄂州",
				'1908' => "黄石",
				'1909' => "咸宁",
				'1910' => "荆州",
				'1911' => "宜昌",
				'1912' => "恩施",
				'1913' => "随州",
				'1914' => "仙桃",
				'1915' => "潜江",
				'1916' => "天门",
				'1917' => "广水",
			),
		),
		'20' => array(
			'province' => "湖南省",
			'city' => array(
				'2001' => "长沙",
				'2002' => "张家界",
				'2003' => "常德",
				'2004' => "岳阳",
				'2005' => "株洲",
				'2006' => "湘潭",
				'2007' => "衡阳",
				'2008' => "郴州",
				'2009' => "永州",
				'2010' => "邵阳",
				'2011' => "怀化",
				'2012' => "娄底",
				'2013' => "吉首",
				'2014' => "益阳",
			),
		),
		'21' => array(
			'province' => "广东省",
			'city' => array(
				'2101' => "广州",
				'2102' => "深圳",
				'2103' => "清远",
				'2104' => "韶关",
				'2105' => "河源",
				'2106' => "梅州",
				'2107' => "潮州",
				'2108' => "汕头",
				'2109' => "揭阳",
				'2110' => "汕尾",
				'2111' => "惠州",
				'2112' => "东莞",
				'2113' => "珠海",
				'2114' => "中山",
				'2115' => "江门",
				'2116' => "佛山",
				'2117' => "茂名",
				'2118' => "湛江",
				'2119' => "阳江",
				'2120' => "云浮",
				'2121' => "肇庆",
			),
		),
		'22' => array(
			'province' => "广西自治区",
			'city' => array(
				'2201' => "南宁",
				'2202' => "桂林",
				'2203' => "柳州",
				'2204' => "贺州",
				'2205' => "玉林",
				'2206' => "钦州",
				'2207' => "北海",
				'2208' => "防城港",
				'2209' => "百色",
				'2210' => "河池",
				'2211' => "贵港",
				'2212' => "梧州",
				'2213' => "崇左市",
				'2214' => "来宾市",
			),
		),
		'23' => array(
			'province' => "海南省",
			'city' => array(
				'2301' => "海口",
				'2302' => "三亚",
				'2303' => "儋州",
				'2304' => "琼海",
				'2305' => "文昌",
				'2306'=> "万宁",
				'2307' => "五指山",
				'2308' => "东方",
			),
		),
		'24' => array(
			'province' => "四川省",
			'city' => array(
				'2401' => "成都",
				'2402' => "广元",
				'2403' => "绵阳",
				'2404' => "德阳",
				'2405' => "南充",
				'2406' => "广安",
				'2407' => "遂宁",
				'2408' => "内江",
				'2409' => "乐山",
				'2410' => "自贡",
				'2411' => "泸州",
				'2412' => "宜宾",
				'2413' => "攀枝花",
				'2414' => "巴中",
				'2415' => "达州",
				'2416' => "资阳",
				'2417' => "雅安",
				'2418' => "西昌",
				'2419' => "阿坝州",
				'2420' => "眉山市",
				'2421' => "凉山州",
				'2422' => "甘孜州",
			),
		),
		'25' => array(
			'province' => "贵州省",
			'city' => array(
				'2501' => "贵阳",
				'2502' => "六盘水",
				'2503' => "遵义",
				'2504' => "毕节",
				'2505' => "铜仁",
				'2506' => "安顺",
				'2507' => "凯里",
				'2508' => "都匀",
				'2509' => "兴义",
				'2510' => "黔东南州",
				'2511' => "黔南州",
				'2512' => "黔西南州",
			),
		),
		'26' => array(
			'province' => "云南省",
			'city' => array(
				'2601' => "昆明",
				'2602' => "曲靖",
				'2603' => "云溪",
				'2604' => "丽江",
				'2605' => "昭通",
				'2606' => "思茅",
				'2607' => "临沧",
				'2608' => "保山",
				'2609' => "潞西",
				'2610' => "泸水",
				'2611' => "中甸",
				'2612' => "大理",
				'2613' => "楚雄",
				'2614' => "个旧",
				'2615' => "文山",
				'2616' => "景洪",
				'2617' => "红河",
				'2618' => "德宏州",
				'2619' => "迪庆州",
				'2620' => "西双版纳州",
				'2621' => "怒江州",
			),
		),
		'27' => array(
			'province' => "西藏自治区",
			'city' => array(
				'2701' => "拉萨",
				'2702' => "那曲",
				'2703' => "昌都",
				'2704' => "林芝",
				'2705' => "乃东",
				'2706' => "日喀则",
				'2707' => "噶尔",
				'2708' => "阿里地区",
				'2709' => "山南地区",
				'2710' => "樟木口岸",
			),
		),
		'28' => array(
			'province' => "陕西省",
			'city' => array(
				'2801' => "西安",
				'2802' => "延安",
				'2803' => "铜川",
				'2804' => "渭南",
				'2805' => "咸阳",
				'2806' => "宝鸡",
				'2807' => "汉中",
				'2809' => "榆林",
				'2810' => "商洛",
				'2811' => "安康",
			),
		),
		'29' => array(
			'province' => "甘肃省",
			'city' => array(
				'2901' => "兰州",
				'2902' => "嘉峪关",
				'2903' => "白银",
				'2904' => "天水",
				'2905' => "酒泉",
				'2906' => "张掖",
				'2907' => "金昌",
				'2908' => "西峰",
				'2909' => "平凉",
				'2910' => "定西",
				'2911' => "陇南",
				'2912' => "临夏",
				'2913' => "武威",
				'2914' => "甘南藏族",
			),
		),
		'30' => array(
			'province' => "宁夏自治区",
			'city' => array(
				'3001' => "银川市",
				'3002' => "石嘴山市",
				'3003' => "吴忠市",
				'3004' => "固原市",
				'3005' => "中卫市",
			),
		),
		'31' => array(
			'province' => "青海省",
			'city' => array(
				'3101' => "西宁",
				'3102' => "平安",
				'3103' => "海晏",
				'3104' => "共和",
				'3105' => "同仁",
				'3106' => "玛沁",
				'3107' => "玉树",
				'3108' => "德令哈",
				'3109' => "果洛藏族自治区",
				'3110' => "海北藏族自治区",
				'3111' => "海东地区",
				'3112' => "海南藏族自治区",
				'3113' => "海西蒙古族藏族自治区",
				'3114' => "黄南藏族自治区",
			),
		),
		'32' => array(
			'province' => "新疆自治区",
			'city' => array(
				'3201' => "乌鲁木齐",
				'3202' => "克拉玛依",
				'3203' => "石河子",
				'3204' => "喀什",
				'3205' => "阿克苏",
				'3206' => "和田",
				'3207' => "吐鲁番",
				'3208' => "哈密",
				'3209' => "阿图什",
				'3210' => "博乐",
				'3211' => "昌吉",
				'3212' => "库尔勒",
				'3213' => "伊犁",
				'3214' => "奎屯",
				'3215' => "塔城",
				'3216' => "阿勒泰",
				'3217' => "巴音郭楞蒙古自治州",
				'3218' => "博尔塔拉蒙古自治州",
				'3219' => "克孜勒苏柯尔克孜自治州",
				'3220' => "伊犁哈萨克自治州",
			),
		),
		'33' => array(
			'province' => "香港",
			'city' => array(
				'3301' => "香港",
			),
		),
		'34' => array(
			'province' => "台湾",
			'city' => array(
				'3402' => "台北",
			),
		)
)


?>